'use strict';
const TASK_CONDITIONS = {
  task1:
    'Створити функцію, яка за номером місяця повертає пору року, до якої відноситься цей місяць.',
  task2: ' Створити функцію, яка за номером місяця повертає його назву',
  task3: 'Створити функцію, яка за номером дня дозволяє з’ясувати чи є цей день робочим',
  task4:
    'Створити функцію, яка для 3 заданих чисел знаходить одночасно декілька результатів: кількість парних, кількість додатних, кількість більших за 100',
  task5: ' Дано покази температур (довільна кількість). Розробити функцію, яка дозволить знайти середнє значення для додатних показів температури',
};
let taskNumber = 1;
for (let key in TASK_CONDITIONS) {
  document.write(`
	<h2 style="color:#e4693b">Задача№${taskNumber}</h2>
	<h3>Умова</h3>
	<p style="max-width: 500px;font-size: 1.2rem;font-weight: 600; color: #e7265d;">${TASK_CONDITIONS[key]}</p>
	<h3>Рішення</h3>
	<div class="taskSolution" style= "color:#30af26"></div>
`);
  taskNumber++;
}
